---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.ProjectId
source: html/785a3851-89dd-cce8-a7ab-50ba2ee76a47.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.ProjectId Property

The id of the external project of the external data item to which a new reference has been added.

## Syntax (C#)
```csharp
public string ProjectId { get; }
```